package hw3_task1;

import java.math.BigInteger;

/*Дано:
Некоторое целое число (передать через аргумент для программы)
Задание: Умножить это число на 256 не используя оператор “ * ”

*/
public class Task1 {

    public static void main (String [] args) {

        //System.out.println( args [0]);
        String num1 = args[0];
        //System.out.println(num1);
        int num1new = Integer.parseInt("10");
        int num2 = 256;

        for (int i = 0; i < num1new ; i++){

             num2 = num2 ;

        }
        System.out.println(num2);

    }

}

