/*Дано: char c = 22; Int b = 78;
Задание: Создать переменную (подумайте какого типа она должна быть),
в полученную переменную записать результат сложения (c+b) и вывести на экран
*/

public class Task3 {
    public static void main (String [] args){
        char c = 22;
        int b = 78;

        int value = (int) c + b;

        System.out.println(value);
    }
}
