/*Task 6
Дано: String begin = “Hello”; String end = “world”;
Задание: Сложить две строки при помощи 3ей переменной и вывести на экран
*/
public class Task6 {
    public static void main (String [] args){
        String begin = "Hello";
        String end = "world";

        String all = begin + " " + end;

        System.out.println (all);
    }
}
