/*Task 1
Дано: Число 23; 45,5;
Задание: Сложить два числа, разделить первое на второе, умножить первое на второе
*/
public class Task1 {
    public static void main (String [] args) {
        int num1 = 23;
        double num2 = 45.5;

        System.out.println("сумма = "+ (num1+num2));
        System.out.println("деление = " + (num1/num2));
        System.out.println("умножение = " +(num1*num2));
    }

}
