package task1;
/*Напишите метод, который сравнивает два числа и выводит наибольшее.
*/
/*class CompareTwoNum {

    int num1;
    int num2;

    int myMethod() {

        if (num1 < num2) {
            System.out.println(num2);
        } else {
            System.out.println(num1);
        }
    }
}*/


